from django.shortcuts import render
from django.http import HttpResponse, JsonResponse


# Create your views here.
def home(request):
    context = {
        "articles": [
            {
                "title": "دنباله فیبوناچی؛ الگوی اسرارآمیز طبیعت",
                "image": "https://cdn01.zoomit.ir/2021/5/fibonacci-sequence.jpg?w=768",
                "description": "دنباله یا اعداد فیبوناچی یکی از معروف‌ترین و زیباترین دنباله‌های ریاضی است که احتمالا نام آن را زیاد شنیده‌اید. در این مقاله در مورد این اعداد اسرارآمیز و کاربرد آن‌ها در طبیعت، موسیقی و فارکس آشنا خواهید شد.آیا تابه‌حال به وجه اشتراک چهره‌ی خود با تخم مرغ، یا وجه شباهت آفتاب‌پرست با آناناس فکر کرده‌اید؟ جهان هستی جای باشکوه و بی‌نهایت پیچیده‌ای است که در آن می‌توان بین عناصر به‌ظاهر نامربوط، رابطه‌ای پیدا کرد. تکرار بی‌شمار الگوهای مشابه در طبیعت به شکل‌گیری سناریوهای مبهوت‌کننده‌ای انجامیده است که به کمک ریاضی به‌راحتی قابل توضیح هستند. به قول آرتور بنجامین، ریاضیدان معروف آمریکایی، افراد اغلب به سه دلیل ریاضی یاد می‌گیرند: برای انجام محاسبات، برای به کار بردن آن در حوزه‌های مختلف و برای الهام گرفتن از آن."
            },
            {
                "title": "کلاغ‌ها مفهوم صفر را درک می‌کنند",
                "image": "https://cdn01.zoomit.ir/2021/6/crow.jpg?w=768",
                "description": "مغز کلاغ‌ها ممکن است از نوع مغز پرندگان باشد؛ اما براساس پژوهشی جدید این پرندگان می‌توانند مفهوم انتزاعی صفر را درک کنند.لایوساینس قبلا گزارش کرده بود که مفهوم صفر به شکلی که در سیستم اعداد استفاده می‌شود، تقریبا در قرن پنجم میلادی یا شاید هم چندین قرن پیش‌تر ایجاد شد. برای مثال، مفهوم ضرب عدد ۸ در صفر یا اضافه کردن صفر به ۱۰ تا آن زمان ایجاد نشده بود. مفهوم هیچ یا عدم هیچ کمیتی احتمالا زودتر ظاهر شده است؛ اما این مورد با استفاده از صفر به‌عنوان کمیت مجزا و مستقلی فرق دارد."
            },
            {
                "title": "بعد جدیدی که می‌تواند درک ماده تاریک را متحول کند",
                "image": "https://cdn01.zoomit.ir/2021/6/dark-matter-extra-dimension-1.jpg?w=768",
                "description": "تاکنون تلاش‌های دانشمندان برای کشف ماده تاریک بی‌نتیجه مانده است. اما به عقیده‌ی یک فیزیکدان می‌توان با تعریف ماده تاریک در ابعاد بالاتر به پاسخ این معما نزدیک شد. تقریبا ۸۵ درصد از جرم جهان را ماده تاریک تشکیل داده است. این ماده هیچ نوری از خود منتشر نمی‌کند، کشف آن آسان نیست و ویژگی‌هایش هم کاملا مشخص نیستند. فیلیپ تاندو یکی از فیزیکدانان نظریه‌ی ذرات و همکاران او از دانشگاه کالیفرنیا مقاله‌ای را در مجله‌ی High Energy Physics منتشر کردند. بر اساس این مقاله، نظریه‌ها نوع جدیدی از نیرو را اثبات می‌کنند که می‌تواند به توصیف ویژگی‌های ماده تاریک کمک کند. تاندو مؤلف ارشد مقاله و استادیار فیزیک و نجوم است."
            },
            {
                "title": "چرا رشد موی سر بیشتر از موی بدن است؟",
                "image": "https://cdn01.zoomit.ir/2021/5/human-hair.jpg?w=768",
                "description": "پوشش مو و خز نقشی اساسی در محافظت از بدن جانداران ایفا می‌کند؛ اما درباره انسان این سؤال اساسی مطرح می‌شد که چرا رشد موی سر از موی بدن بیشتر است؟انسان‌ها گونه‌های عجیبی از پستانداران هستند. به‌غیر از کرگدن‌ها و موش‌های کور برهنه تقریبا تمام پستانداران پوشش مویی روی بدنشان دارند‌؛ اما انسان‌ها، تنها گونه‌هایی هستند که رشد موی سرشان بیشتر از موی بدن است؛ اما دلیل این تفاوت چیست؟به‌گفته مارک پاگل، زیست‌شناس تکاملی در دانشگاه ریدینگ بریتانیا، در ابتدا باید بفهمیم چرا پستانداران خز و مو دارند. خز گرمای بدن حیوانات را در شب‌های سرد حفظ می‌کند و در طول روز از آن‌ دربرابر نور خورشید محافظت می‌کند. اجداد انسان بخش زیادی از موی بدنشان را از دست دادند؛ اما از توانایی منحصر‌به‌فردی برای برپایی آتش و ساخت پناهگاه و لباس برخوردار بودند. به‌همین‌دلیل، پیشینیان انسان بدون بخش زیادی از موها بقایشان را حفظ کردند؛ ولی مشخص نیست چرا به‌مرور‌زمان موهایشان را از دست دادند.بی‌مویی نوعی مزیت تکاملی به انسان‌ها بخشید. سه نظریه اصلی درباره مزایای بی‌مویی وجود دارد. در درجه اول پوشش ضخیم خز و مو باعث می‌شد انسان کهن در طول روز درمعرض نور خورشید دچار گرمازدگی شود. پاگل می‌گوید: «اگر پوشش خز بزرگی را در فصل گرما در میانه ساوانای آفریقا بپوشید، دمای بدنتان بسیار افزایش خواهد یافت. پس بهتر نبود اگر می‌توانستید این پوشش را از تن دربیاورید؟»"
            },
            {
                "title": "گوگل قصد دارد تا سال ۲۰۲۹ کامپیوتر کوانتومی «مفید» بسازد",
                "image": "https://cdn01.zoomit.ir/2020/7/98e6d032-a1e7-4462-b5dd-b23e2c3720f9.jpg?w=768",
                "description": "سال ۲۰۱۹ گوگل مدعی شد به برتری کوانتومی دست یافته و حالا اعلام کرده است که قصد دارد تا سال ۲۰۲۹ «کامپیوتر کوانتومی مفید و بدون خطا» بسازد.به‌گزارش Verge، گوگل امیدوار است تکنولوژی کوانتومی بتواند در حل بسیاری از مشکلات بزرگ ازجمله وضعیت تغذیه در جهان و تغییرات اقلیمی و تولید داروهای بهتر مفید واقع شود. اهالی مانتین‌ویو برای توسعه این تکنولوژی پردیس جدید Quantum AI در سانتا‌باربارا را رونمایی کردند که شامل مرکز داده کوانتومی و آزمایشگاه‌های تحقیقاتی سخت‌افزار و امکانات ساخت تراشه پردازنده کوانتومی است.طبق گزارش وال استریت ژورنال، این غول تکنولوژی در دَه سال آینده، میلیاردها دلار صرف طراحی و تولید این کامپیوتر خواهد کرد.برنامه ساخت این کامپیوتر دیروز در مراسم توسعه‌دهندگان گوگل موسوم به Google I/O و یک‌ونیم سال بعد از آن اعلام شد که این شرکت مدعی دستیابی به برتری کوانتومی شد‌. برتری کوانتومی نقطه عطفی در رایانش است که در آن، کامپیوتر کوانتومی می‌تواند محاسبه‌ای انجام دهد که کامپیوتر معمولی هرگز ازپسِ آن بر‌نمی‌آید."
            },
            {
                "title": "اولین پشه‌های اصلاح‌شده ژنتیکی در آمریکا رها شدند",
                "image": "https://cdn01.zoomit.ir/2021/5/insect.jpg?w=768",
                "description": "شرکت بیوتکنولوژی اوکسیتک پس از سال‌ها مخالفت ساکنان و عبور از موانع مقرراتی، آزمایش میدانی بحث‌برانگیز حشرات خود را در فلوریدا آغاز کرد.پس از یک دهه مبارزه برای گرفتن تأیید نظارتی و پذیرش عمومی، یکی از شرکت‌های بیوتکنولوژی اولین‌بار پشه‌های مهندسی‌شده ژنتیکی را در هوای باز آمریکا آزاد کرده است. این آزمایش که هفته جاری در فلوریدا کیز آغاز شد، روشی برای سرکوب جمعیت‌های پشه‌های آئدس اجیپتی (Aedes aegypti) را آزمایش می‌کند. پشه‌ی مذکور می‌تواند بیماری‌هایی مانند زیکا، دنگ، چیکونگونیا و تب زرد را منتقل کند."
            }
        ]
    }
    return render(request, 'blog/home.html', context)
